In [1]:
import pandas as pd
import numpy as np
import re

In [2]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])

In [3]:
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [4]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])

In [6]:
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [7]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [8]:
float_data = pd.Series([1, 2, None], dtype='float64')

In [9]:
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [10]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [11]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

In [12]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan], [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [15]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [17]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data[4] = np.nan

In [19]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [20]:
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))

In [22]:
df.iloc[:4, 1] = np.nan

In [23]:
df.iloc[:2, 2] = np.nan

In [24]:
df

          0         1         2
0 -0.246268       NaN       NaN
1  1.469530       NaN       NaN
2  0.546836       NaN  1.184215
3  2.389651       NaN -0.489022
4 -2.144354 -1.807622 -0.132240
5 -0.125084 -0.797525 -0.617830
6  1.986176  0.971694 -0.697865

In [25]:
df.dropna()

          0         1         2
4 -2.144354 -1.807622 -0.132240
5 -0.125084 -0.797525 -0.617830
6  1.986176  0.971694 -0.697865

In [26]:
df.dropna(thresh=2)

          0         1         2
2  0.546836       NaN  1.184215
3  2.389651       NaN -0.489022
4 -2.144354 -1.807622 -0.132240
5 -0.125084 -0.797525 -0.617830
6  1.986176  0.971694 -0.697865

In [27]:
df.fillna(0)

          0         1         2
0 -0.246268  0.000000  0.000000
1  1.469530  0.000000  0.000000
2  0.546836  0.000000  1.184215
3  2.389651  0.000000 -0.489022
4 -2.144354 -1.807622 -0.132240
5 -0.125084 -0.797525 -0.617830
6  1.986176  0.971694 -0.697865

In [28]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.246268  0.500000  0.000000
1  1.469530  0.500000  0.000000
2  0.546836  0.500000  1.184215
3  2.389651  0.500000 -0.489022
4 -2.144354 -1.807622 -0.132240
5 -0.125084 -0.797525 -0.617830
6  1.986176  0.971694 -0.697865

In [29]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))

In [30]:
df

          0         1         2
0 -1.244261 -0.053015 -0.740733
1  0.930165  0.402401 -0.620465
2  0.046981 -1.157388 -0.410843
3  1.447489  0.717165 -0.242291
4 -0.428662 -0.034813 -0.702865
5 -0.848932  0.254947  0.465500

In [31]:
df.iloc[2:, 1] = np.nan

In [32]:
df.iloc[4:, 2] = np.nan

In [33]:
df

          0         1         2
0 -1.244261 -0.053015 -0.740733
1  0.930165  0.402401 -0.620465
2  0.046981       NaN -0.410843
3  1.447489       NaN -0.242291
4 -0.428662       NaN       NaN
5 -0.848932       NaN       NaN

In [34]:
df.fillna(method="ffill")

/tmp/ipykernel_2847/3944122520.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

          0         1         2
0 -1.244261 -0.053015 -0.740733
1  0.930165  0.402401 -0.620465
2  0.046981  0.402401 -0.410843
3  1.447489  0.402401 -0.242291
4 -0.428662  0.402401 -0.242291
5 -0.848932  0.402401 -0.242291

In [35]:
df.fillna(method="ffill", limit=2)

/tmp/ipykernel_2847/1627181726.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill", limit=2)

          0         1         2
0 -1.244261 -0.053015 -0.740733
1  0.930165  0.402401 -0.620465
2  0.046981  0.402401 -0.410843
3  1.447489  0.402401 -0.242291
4 -0.428662       NaN -0.242291
5 -0.848932       NaN -0.242291

In [36]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])

In [37]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [38]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
                     "k2": [1, 1, 2, 3, 3, 4, 4]})

In [39]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [40]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [41]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [42]:
data["v1"] = range(7)

In [43]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [44]:
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [45]:
data.drop_duplicates(["k1", "k2"], keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [46]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [47]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [48]:
meat_to_animal = {
    "bacon": "pig",
    "pulled pork": "pig",
    "pastrami": "cow",
    "corned beef": "cow",
    "honey ham": "pig",
    "nova lox": "salmon"
}

In [49]:
data["animal"] = data["food"].map(meat_to_animal)

In [50]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [51]:
def get_animal(x):
    return meat_to_animal[x]

In [52]:
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [53]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [54]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [55]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [56]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [57]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [58]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [59]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])

In [60]:
def transform(x):
    return x[:4].upper()

In [61]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [62]:
data.index = data.index.map(transform)

In [63]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [64]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [65]:
data.rename(index={"OHIO": "INDIANA"},
            columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [66]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [67]:
bins = [18, 25, 35, 60, 100]

In [68]:
age_categories = pd.cut(ages, bins)

In [69]:
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [70]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [71]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [72]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [73]:
pd.value_counts(age_categories)

/tmp/ipykernel_2847/3010498523.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [74]:
pd.Series.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [75]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [76]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

In [77]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [78]:
data = np.random.uniform(size=20)

In [79]:
pd.cut(data, 4, precision=2)

[(0.082, 0.29], (0.29, 0.5], (0.082, 0.29], (0.29, 0.5], (0.71, 0.92], ..., (0.29, 0.5], (0.29, 0.5], (0.29, 0.5], (0.71, 0.92], (0.29, 0.5]]
Length: 20
Categories (4, interval[float64, right]): [(0.082, 0.29] < (0.29, 0.5] < (0.5, 0.71] < (0.71, 0.92]]

In [80]:
data = np.random.standard_normal(1000)

In [81]:
quartiles = pd.qcut(data, 4, precision=2)

In [82]:
quartiles

[(-0.74, -0.041], (-3.4, -0.74], (-0.74, -0.041], (-0.041, 0.68], (-0.041, 0.68], ..., (-0.041, 0.68], (-3.4, -0.74], (-0.041, 0.68], (0.68, 3.01], (-3.4, -0.74]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.4, -0.74] < (-0.74, -0.041] < (-0.041, 0.68] < (0.68, 3.01]]

In [83]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-3.3859999999999997, -1.309]    100
(-1.309, -0.0409]                400
(-0.0409, 1.204]                 400
(1.204, 3.01]                    100
Name: count, dtype: int64

In [84]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).categories

IntervalIndex([(-3.3859999999999997, -1.309],             (-1.309, -0.0409],
                            (-0.0409, 1.204],                 (1.204, 3.01]],
              dtype='interval[float64, right]')

In [85]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))

In [86]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.029281     0.004052     0.029307    -0.016038
std       0.976256     1.014650     0.977162     1.003330
min      -3.156357    -3.273112    -2.839300    -2.964568
25%      -0.735148    -0.688258    -0.639776    -0.738269
50%       0.002720     0.002840    -0.023186     0.000248
75%       0.634536     0.685941     0.709937     0.703851
max       2.820518     3.364323     4.174356     2.917898

In [87]:
col = data[2]

In [88]:
col[col.abs() > 3]

540    4.174356
Name: 2, dtype: float64

In [89]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
152 -0.170123 -3.009219 -1.378641 -0.230274
262 -3.156357 -0.901058  1.233777  0.191939
396 -0.423475  3.031666  2.164402 -1.108888
404  1.581400 -3.273112 -1.607242 -0.600456
540  0.505094  0.658706  4.174356 -0.015807
575 -1.217995  3.304160 -1.664023  0.494859
705 -0.330499  3.364323 -0.493544  0.118673

In [90]:
data[data.abs() > 3] = np.sign(data) * 3

In [91]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.029125     0.003634     0.028133    -0.016038
std       0.975767     1.011591     0.972872     1.003330
min      -3.000000    -3.000000    -2.839300    -2.964568
25%      -0.735148    -0.688258    -0.639776    -0.738269
50%       0.002720     0.002840    -0.023186     0.000248
75%       0.634536     0.685941     0.709937     0.703851
max       2.820518     3.000000     3.000000     2.917898

In [92]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0 -1.0
1 -1.0 -1.0  1.0 -1.0
2 -1.0 -1.0 -1.0 -1.0
3 -1.0  1.0  1.0  1.0
4  1.0  1.0  1.0  1.0

In [93]:
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))

In [94]:
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [95]:
sampler = np.random.permutation(5)

In [96]:
sampler

array([1, 0, 3, 4, 2])

In [97]:
df.take(sampler)

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
2  14  15  16  17  18  19  20

In [98]:
df.iloc[sampler]

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
2  14  15  16  17  18  19  20

In [99]:
column_sampler = np.random.permutation(7)

In [100]:
column_sampler

array([4, 0, 1, 3, 2, 6, 5])

In [101]:
df.take(column_sampler, axis="columns")

    4   0   1   3   2   6   5
0   4   0   1   3   2   6   5
1  11   7   8  10   9  13  12
2  18  14  15  17  16  20  19
3  25  21  22  24  23  27  26
4  32  28  29  31  30  34  33

In [102]:
df.sample(n=3)

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6

In [103]:
df.sample(n=5)

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27

In [104]:
choices = pd.Series([5, 7, -1, 6, 4])

In [105]:
choices.sample(n=10, replace=True)

2   -1
0    5
4    4
1    7
2   -1
1    7
3    6
4    4
0    5
0    5
dtype: int64

In [106]:
choices.sample(n=10, replace=True)

4    4
0    5
4    4
0    5
1    7
0    5
3    6
2   -1
4    4
2   -1
dtype: int64

In [107]:
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})

In [108]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [109]:
pd.get_dummies(df["key"])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [110]:
dummies = pd.get_dummies(df["key"], prefix="key")

In [111]:
df_with_dummy = df[["data1"]].join(dummies)

In [112]:
dummies

   key_a  key_b  key_c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [113]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0  False   True  False
1      1  False   True  False
2      2   True  False  False
3      3  False  False   True
4      4   True  False  False
5      5  False   True  False

In [114]:
mnames = ["movie_id", "title", "genres"]

In [115]:
movies = pd.read_table("datasets/movielens/movies.dat", sep="::", 
                        header=None, names=mnames, engine="python")

In [116]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [117]:
dummies = movies["genres"].str.get_dummies("|")

In [118]:
dummies.iloc[:10, :6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [119]:
movies_windic = movies.join(dummies.add_prefix("Genres_"))

In [120]:
movies_windic.iloc[0]

movie_id                                        1
title                            Toy Story (1995)
genres                Animation|Children's|Comedy
Genres_Action                                   0
Genres_Adventure                                0
Genres_Animation                                1
Genres_Children's                               1
Genres_Comedy                                   1
Genres_Crime                                    0
Genres_Documentary                              0
Genres_Drama                                    0
Genres_Fantasy                                  0
Genres_Film-Noir                                0
Genres_Horror                                   0
Genres_Musical                                  0
Genres_Mystery                                  0
Genres_Romance                                  0
Genres_Sci-Fi                                   0
Genres_Thriller                                 0
Genres_War                                      0
Genres_Western                                  0
Name: 0, dtype: object

In [121]:
np.random.seed(12345)

In [122]:
values = np.random.uniform(size=10)

In [123]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [124]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [125]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False       False        True
1       False        True       False       False       False
2        True       False       False       False       False
3       False        True       False       False       False
4       False       False        True       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False       False        True       False
8       False       False       False        True       False
9       False       False       False        True       False

In [126]:
s = pd.Series([1, 2, 3, None])

In [127]:
s

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64

In [128]:
s = pd.Series([1, 2, 3, None], dtype=pd.Int64Dtype())

In [129]:
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [130]:
s.isna()

0    False
1    False
2    False
3     True
dtype: bool

In [131]:
s.dtype

Int64Dtype()

In [132]:
s[3]

In [133]:
s[3] is pd.NA

True

In [134]:
s = pd.Series([1, 2, 3, None], dtype="Int64")

In [135]:
s

0       1
1       2
2       3
3    <NA>
dtype: Int64

<!-- 7.4 string manipolation -->

In [136]:
# 7.4 string manipolation

In [137]:
val = "a,b, guido"

In [138]:
val.split(",")

['a', 'b', ' guido']

In [139]:
pieces = [x.strip() for x in val.split(",")]

In [140]:
pieces

['a', 'b', 'guido']

In [141]:
first, second, third = pieces

In [142]:
first + "::" + second + "::" + third

'a::b::guido'

In [143]:
"::".join(pieces)

'a::b::guido'

In [144]:
"guido" in val

True

In [145]:
val.index(",")

1

In [146]:
val.find(":")

-1

In [147]:
val.count(",")

2

In [148]:
val.replace(",", "::")

'a::b:: guido'

In [149]:
val.replace(",", "")

'ab guido'

In [150]:
text = "foo    bar\t baz  \tqux"

In [151]:
re.split(r"\s+", text)

['foo', 'bar', 'baz', 'qux']

In [152]:
regex = re.compile(r"\s+")

In [153]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [154]:
regex.findall(text)

['    ', '\t ', '  \t']

In [155]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

# re.IGNORECASE not case sensitive

In [156]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [157]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [158]:
m = regex.search(text)

In [159]:
m

In [160]:
text[m.start():m.end()]

'dave@google.com'

In [161]:
print(regex.match(text))

None

In [162]:
print(regex.sub("REDACTED", text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [163]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"

In [164]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [165]:
m = regex.match("wesm@bright.net")

In [166]:
m.groups()

('wesm', 'bright', 'net')

In [167]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [168]:
print(regex.sub(r"Username: \1, Domain: \2, Suffix: \3", text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

# 7.4.3 pandas string function

In [169]:
data = {"Dave": "dave@google.com", "Steve": "steve@gmail.com",
        "Rob": "rob@gmail.com", "Wes": np.nan}

In [170]:
data = pd.Series(data)

In [171]:
data.isna()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [172]:
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [173]:
data_as_string_ext = data.astype('string')

In [174]:
data_as_string_ext

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                 <NA>
dtype: string

In [175]:
data_as_string_ext.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes       <NA>
dtype: boolean

In [176]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"

In [177]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [178]:
matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]

In [179]:
matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [180]:
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [181]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [182]:
data.str.extract(pattern, flags=re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

# 7.5 categorical data

# 7.5.1 background and targets

In [183]:
values = pd.Series(['apple', 'orange', 'apple', 'apple'] * 2)

In [184]:
values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [185]:
pd.unique(values)

array(['apple', 'orange'], dtype=object)

In [186]:
pd.value_counts(values)

/tmp/ipykernel_2847/3297668723.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(values)

apple     6
orange    2
Name: count, dtype: int64

In [187]:
pd.Series.value_counts(values)

apple     6
orange    2
Name: count, dtype: int64

In [188]:
values = pd.Series([0, 1, 0, 0] * 2)

In [189]:
dim = pd.Series(['apple', 'orange'])

In [190]:
values

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64

In [191]:
dim

0     apple
1    orange
dtype: object

In [192]:
dim.take(values)

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

# 7.5.2 calssification extension type of pandas

In [193]:
fruits = ['apple', 'orange', 'apple', 'apple'] * 2

In [194]:
N = len(fruits)

In [195]:
rng = np.random.default_rng(seed=12345)

In [196]:
df = pd.DataFrame({'fruit': fruits,
                   'basket_id': np.arange(N),
                   'count': rng.integers(3, 15, size=N),
                   'weight': rng.uniform(0, 4, size=N),},
                   columns=['basket_id', 'fruit', 'count', 'weight'])

In [197]:
df

   basket_id   fruit  count    weight
0          0   apple     11  1.564438
1          1  orange      5  1.331256
2          2   apple     12  2.393235
3          3   apple      6  0.746937
4          4   apple      5  2.691024
5          5  orange     12  3.767211
6          6   apple     10  0.992983
7          7   apple     11  3.795525

In [198]:
fruit_cat = df['fruit'].astype('category')

In [199]:
fruit_cat

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [200]:
c = fruit_cat.array

In [201]:
type(c)

pandas.core.arrays.categorical.Categorical

In [202]:
c.categories

Index(['apple', 'orange'], dtype='object')

In [203]:
c.codes

array([0, 1, 0, 0, 0, 1, 0, 0], dtype=int8)

In [204]:
dict(enumerate(c.categories))

{0: 'apple', 1: 'orange'}

In [205]:
df['fruit'] = df['fruit'].astype('category')

In [206]:
df['fruit']

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [207]:
my_categories = pd.Categorical(['foo', 'bar', 'bar', 'foo', 'bar'])

In [208]:
my_categories

['foo', 'bar', 'bar', 'foo', 'bar']
Categories (2, object): ['bar', 'foo']

In [209]:
categories = ['foo', 'bar', 'baz']

In [210]:
codes = [0, 1, 2, 0, 0, 1]

In [211]:
my_cats_2 = pd.Categorical.from_codes(codes, categories)

In [212]:
my_cats_2

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo', 'bar', 'baz']

In [213]:
ordered_cat = pd.Categorical.from_codes(codes, categories,
                                        ordered=True)

In [214]:
ordered_cat

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [216]:
my_cats_2

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo', 'bar', 'baz']

# 7.5.3 calculations of categorical object

In [217]:
rng = np.random.default_rng(seed=12345)

In [218]:
draws = rng.standard_normal(1000)

In [219]:
draws[:5]

array([-1.42382504,  1.26372846, -0.87066174, -0.25917323, -0.07534331])

In [220]:
bins = pd.qcut(draws, 4)

In [221]:
bins

[(-3.121, -0.675], (0.687, 3.211], (-3.121, -0.675], (-0.675, 0.0134], (-0.675, 0.0134], ..., (0.0134, 0.687], (0.0134, 0.687], (-0.675, 0.0134], (0.0134, 0.687], (-0.675, 0.0134]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.121, -0.675] < (-0.675, 0.0134] < (0.0134, 0.687] < (0.687, 3.211]]

In [222]:
bins = pd.qcut(draws, 4, labels=['Q1', 'Q2', 'Q3', 'Q4'])

In [223]:
bins

['Q1', 'Q4', 'Q1', 'Q2', 'Q2', ..., 'Q3', 'Q3', 'Q2', 'Q3', 'Q2']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [224]:
bins.codes[:10]

array([0, 3, 0, 1, 1, 0, 0, 2, 2, 0], dtype=int8)

In [225]:
bins = pd.Series(bins, name='quartile')

In [226]:
results = (pd.Series(draws)
           .groupby(bins)
           .agg(['count', 'min', 'max'])
           .reset_index())

/tmp/ipykernel_2847/1248366115.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  .groupby(bins)

In [227]:
results

  quartile  count       min       max
0       Q1    250 -3.119609 -0.678494
1       Q2    250 -0.673305  0.008009
2       Q3    250  0.018753  0.686183
3       Q4    250  0.688282  3.211418

In [228]:
results['quartile']

0    Q1
1    Q2
2    Q3
3    Q4
Name: quartile, dtype: category
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [229]:
N = 10_000_000

In [230]:
labels = pd.Series(['foo', 'bar', 'baz', 'qux'] * (N // 4))

In [231]:
categories = labels.astype('category')

In [232]:
labels.memory_usage(deep=True)

600000128

In [233]:
categories.memory_usage(deep=True)

10000540

In [234]:
%time _ = labels.astype('category')

CPU times: user 396 ms, sys: 74.4 ms, total: 471 ms
Wall time: 468 ms

In [235]:
%timeit labels.value_counts()

375 ms  15.9 ms per loop (mean  std. dev. of 7 runs, 1 loop each)

In [236]:
%timeit categories.value_counts()

33.6 ms  1.36 ms per loop (mean  std. dev. of 7 runs, 10 loops each)

# 7.5.4 classification method

In [237]:
s = pd.Series(['a', 'b', 'c', 'd'] * 2)

In [238]:
cat_s = s.astype('category')

In [239]:
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [240]:
cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [241]:
cat_s.cat.categories

Index(['a', 'b', 'c', 'd'], dtype='object')

In [242]:
actual_categories = ['a', 'b', 'c', 'd', 'e']

In [243]:
cat_s2 = cat_s.cat.set_categories(actual_categories)

In [244]:
cat_s2

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [245]:
cat_s.value_counts()

a    2
b    2
c    2
d    2
Name: count, dtype: int64

In [246]:
cat_s2.value_counts()

a    2
b    2
c    2
d    2
e    0
Name: count, dtype: int64

In [247]:
cat_s3 = cat_s[cat_s.isin(['a', 'b'])]

In [248]:
cat_s3

0    a
1    b
4    a
5    b
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [249]:
cat_s3.cat.remove_unused_categories()

0    a
1    b
4    a
5    b
dtype: category
Categories (2, object): ['a', 'b']

In [250]:
cat_s = pd.Series(['a', 'b', 'c', 'd'] * 2, dtype='category')

In [251]:
pd.get_dummies(cat_s)

       a      b      c      d
0   True  False  False  False
1  False   True  False  False
2  False  False   True  False
3  False  False  False   True
4   True  False  False  False
5  False   True  False  False
6  False  False   True  False
7  False  False  False   True